app/controllers/events_controller.rb

  def create
    @event = Event.new(params[:event])
    if @event.save
---
INSERT INTO "events" ("created_at", "creator_id", "date", "description", "location", "updated_at") VALUES (?, ?, ?, ?, ?, ?)