app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = 'email@email.it' LIMIT 1
---
  def create
    email = params[:email]
    @user = User.find_by_email(email)