app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 22 Sep 2014 12:43:52 UTC +00:00], ["email", nil], ["name", nil], ["updated_at", Mon, 22 Sep 2014 12:43:52 UTC +00:00]]
---
  def create
    @user = User.new(params[:user])
    if @user.save